In [1]:
import pandas as pd

data = pd.read_csv('employees.csv')
data.head()
data.info()
data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ID            10 non-null     int64
 1   Name          10 non-null     object
 2   Department    10 non-null     object
 3   Age           10 non-null     int64
 4   Salary        10 non-null     int64
 5   Joining_Date  10 non-null     object
dtypes: int64(3), object(3)
memory usage: 608.0+ bytes

   ID           Name Department  Age  Salary Joining_Date
0   1       John Doe         HR   28   50000   2020-05-21
1   2     Jane Smith         IT   34   75000   2019-06-12
2   3    Bob Johnson    Finance   45   85000   2018-07-15
3   4    Alice White         IT   29   72000   2021-01-04
4   5  Charlie Brown  Marketing   32   68000   2019-11-30
5   6      Eva Green         HR   41   54000   2017-04-22
6   7     Mike Davis    Finance   50   90000   2016-08-19
7   8   Linda Taylor         IT   26   64000   2022-02-10
8   9   James Wilson  Marketing   38   70000   2020-09-08
9  10    Sarah Adams         HR   30   55000   2021-03-18

Filter Employees

In [2]:
it_employees = data[data['Department'] == 'IT']
avg_salary = data.groupby('Department')['Salary'].mean()

data["New_Salary"] = data["Salary"] * 1.05
data.head()
sortedData = data.sort_values(by='Salary', ascending=False)
sortedData.reset_index(inplace=True)
sortedData.head(15)

   index  ID           Name Department  Age  Salary Joining_Date  New_Salary
0      6   7     Mike Davis    Finance   50   90000   2016-08-19     94500.0
1      2   3    Bob Johnson    Finance   45   85000   2018-07-15     89250.0
2      1   2     Jane Smith         IT   34   75000   2019-06-12     78750.0
3      3   4    Alice White         IT   29   72000   2021-01-04     75600.0
4      8   9   James Wilson  Marketing   38   70000   2020-09-08     73500.0
5      4   5  Charlie Brown  Marketing   32   68000   2019-11-30     71400.0
6      7   8   Linda Taylor         IT   26   64000   2022-02-10     67200.0
7      9  10    Sarah Adams         HR   30   55000   2021-03-18     57750.0
8      5   6      Eva Green         HR   41   54000   2017-04-22     56700.0
9      0   1       John Doe         HR   28   50000   2020-05-21     52500.0

In [4]:
data["Department"].value_counts()
data["Joining_Date"] = pd.to_datetime(data["Joining_Date"])
data[data["Joining_Date"] > "2021-01-30"]

   ID          Name Department  Age  Salary Joining_Date  New_Salary
7   8  Linda Taylor         IT   26   64000   2022-02-10     67200.0
9  10   Sarah Adams         HR   30   55000   2021-03-18     57750.0